app/controllers/animals_controller.rb

SELECT "animals".* FROM "animals"
---
  def index
    @animals = Animal.all

SELECT "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT 1  [["id", "1"]]
---
    def find_animal
      @animal=Animal.find(params[:id])