app/controllers/cuts_controller.rb

SELECT "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "cuts".* FROM "cuts" WHERE "cuts"."primal_cut_id" = 1
SELECT "primal_cuts".* FROM "primal_cuts" WHERE "primal_cuts"."id" = ? LIMIT 1  [["id", "1"]]
---
    def find_animal_or_primal_cut
      @parent = params[:animal_id].present? ? Animal.find(params[:animal_id]) : PrimalCut.find(params[:primal_cut_id])