app/controllers/primal_cuts_controller.rb

  def index
    @primal_cuts = @animal.primal_cuts.all
---
SELECT "cuts".* FROM "cuts" WHERE "cuts"."primal_cut_id" = 1
SELECT "primal_cuts".* FROM "primal_cuts" WHERE "primal_cuts"."animal_id" = 1

    def find_animal
      @animal = Animal.find params[:animal_id]
---
SELECT "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT 1  [["id", "1"]]

    def find_primal_cut
      @primal_cut = PrimalCut.find params[:id]
---
SELECT "primal_cuts".* FROM "primal_cuts" WHERE "primal_cuts"."id" = ? LIMIT 1  [["id", "3"]]